import {Pioneer} from "./types";

export const requestTime = 1000


export const iPioneersMock:Pioneer[] = [
    {
        id: 1,
        name: "Христофор Колумб",
        description: "            Христофо́р Колу́мб (итал. Cristoforo Colombo, исп. Cristóbal Colón, лат. Christophorus Columbus; между 26 августа и 31 октября 1451, Генуэзская республика — 20 мая 1506, Вальядолид, Королевство Кастилия и Леон) — испанский мореплаватель итальянского происхождения, в 1492 году открывший для европейцев Новый Свет (Америку).\n" +
            "\n" +
            "Колумб первым из достоверно известных путешественников пересёк Атлантический океан в субтропической и тропической полосе Северного полушария и первым из европейцев ходил в Карибском море и в Саргассовом море[3]. Он открыл Южную Америку и Центральную Америку и положил начало их исследованию, включая континентальные части и близлежащие архипелаги — Большие Антильские (Куба, Гаити, Ямайка и Пуэрто-Рико), Малые Антильские (от Доминики до Виргинских островов, а также Тринидад) и Багамские острова.\n" +
            "\n" +
            "Первооткрывателем Америки для европейцев Колумба можно назвать с оговорками, ведь ещё в Средние века на территории Северной Америки бывали европейцы в лице исландских викингов (см. Винланд). Но поскольку за пределами Скандинавии сведений об этих походах не было, именно экспедиции Колумба впервые сделали сведения о землях на западе всеобщим достоянием и положили начало колонизации Америки европейцами.\n" +
            "\n" +
            "Всего Колумб совершил 4 плавания к берегам Америки:",
        status: 1,
        image: "",
        date_birthday: 1451,
        date_death: 1506
    },
    {
        id: 2,
        name: "Фредерик Кук",
        description: "Фредерик Кук родился в семье немецких иммигрантов; несмотря на неблагоприятные жизненные обстоятельства и бедность, получил медицинское образование. Впервые участвовал в арктической экспедиции в 1891—1892 годах в составе отряда Пири в Северной Гренландии; в 1893—1894 годах в летний сезон предпринял два самостоятельных плавания к побережью Гренландии. В 1897—1898 годах участвовал в Бельгийской антарктической экспедиции, совершившей незапланированный дрейф в Море Беллинсгаузена. Во время путешествия познакомился с Руалем Амундсеном, штурманом экспедиции, и до самой его гибели в 1928 году исследователи поддерживали дружеские отношения. В 1894—1913 годах Фредерик Кук состоял действительным членом Арктического клуба, является одним из его основателей. В 1900 году Кук в очередной раз посетил Гренландию, где Роберт Пири находился в экспедиции, и отказался остаться с ним на зимовку. В 1903—1906 годах Кук занимался исследованиями на Аляске и предпринял попытку покорения вершины Мак-Кинли. В 1904 году стал одним из сооснователей Клуба Исследователей[en], в 1907—1908 годах был избран его почётным президентом. В 1907—1909 годах вновь находился в Арктике, объявив о попытке достижения Северного полюса. После неудачных судебных разбирательств с Пири, в 1910—1916 годах проводил многочисленные лекционные турне, распространяя книги о путешествии в Центральную Арктику; совершил кругосветное путешествие. После завершения карьеры путешественника занимался разведкой и продажей нефтеносных земель на Западе США. По обвинению в мошенничестве был осуждён на длительное тюремное заключение, которое отбывал в 1924—1930 годах. После освобождения за отсутствием состава преступления (все проданные участки были прибыльными) работал врачом и пытался восстановить репутацию и свой приоритет. Незадолго до кончины в 1940 году указом президента США Ф. Рузвельта был реабилитирован по всем пунктам обвинения. С 1956 года функционирует Общество Фредерика Кука, которое исследует его наследие и добивается признания приоритета в географических открытиях.",
        status: 1,
        image: "",
        date_birthday: 1865,
        date_death: 1940
    },
    {
        id: 3,
        name: "Михаил Петрович Лазарев",
        description: "Родился в губернском городе Владимире. Сын сенатора Петра Гавриловича Лазарева, происходившего из дворян Арзамасского уезда Нижегородской губернии. Незадолго до смерти, в 1800 году отец определил троих сыновей — Андрея, Михаила, Алексея — в Морской кадетский корпус. При этом попечение над осиротевшими братьями взял на себя друг их отца — поэт Гавриил Романович Державин, не имевший своих детей.\n" +
            "\n" +
            "В 1803 году выдержал экзамен на звание гардемарина, став третьим по успеваемости из 32 учеников. В числе 30 лучших выпускников корпуса отправлен в Великобританию, где служил военным на флоте до 1808 года для ознакомления с постановкой военно-морского дела в иностранных портах. В течение пяти лет находился в непрерывном плавании в Атлантическом океане и Средиземном море.\n" +
            "\n" +
            "Произведён в мичманы 21 мая 1808 года как «прибывший из Англии».\n" +
            "\n" +
            "В 1808—1813 годах служил на Балтийском флоте. Участвовал в Русско-шведской 1808—1809 годов и Отечественной войне 1812 года.\n" +
            "\n" +
            "Совместно с Фаддеем Беллинсгаузеном командовал Первой русской антарктической экспедицией 1819—1821 годов, которая впервые в истории человечества подошла к шельфовым ледникам Антарктиды.\n",
        status: 1,
        image: "",
        date_birthday: 1788,
        date_death: 1851
    },
]